Repository: CherokeeLanguage/Action-Imitation-and-Fun-Series
Catalog: 06-Red-Riding-Hood/CAT/red-riding-hood-seven-kids/tm/corpus-nt-bbe.en.utf8.tmx
Source language: en
Languages: chr

source: In the same way, when you have done all the things which are given you to do, say, There is no profit in us, for we have only done what we were ordered to do.
chr: ᎾᏍᎩᏯ ᎾᏍᏉ ᏂᎯ, ᎿᏉ ᏂᎦᏛ ᏄᏥᏪᏎᎸ ᏂᏣᏛᏁᎰᏅᎭ, ᎯᎠ ᏂᏥᏪᏒᎭ, ᎪᎱᏍᏗ ᎣᎬᏙᏗ ᏂᎨᏒᎾ ᎣᎩᏅᏏᏓᏍᏗ; ᎢᏲᎦᏛᏁᏗᏉ ᎨᏒ ᏃᎦᏛᏁᎸ.

source: And it came about that when they were on the way to Jerusalem he went through Samaria and Galilee.
chr: ᎯᎠᏃ ᏄᎵᏍᏔᏁ ᎾᏍᎩ ᏥᎷᏏᎵᎻ ᏩᎦᏖᎢ, ᏌᎺᎵᏱ ᎠᎴ ᎨᎵᎵ ᎠᏰᎵ ᎤᎶᏎᎢ.

source: And when he went into a certain small town he came across ten men who were lepers, and they, keeping themselves at a distance,
chr: ᎢᎸᎯᏢᏃ ᎦᏚᎲ ᏩᏴᎯᎲᎢ ᎠᏍᎪᎯ ᎢᏯᏂᏛ ᎠᏂᏍᎦᏯ ᎠᏓᏰᏍᎩ ᏧᏂᏢᎩ ᏕᎬᏩᏠᏎᎢ, ᎢᏅ ᏧᎾᎴᏅᏁᎢ;

source: Said, in loud voices, Jesus, Master, have mercy on us.
chr: ᎠᎴ ᎤᏂᏌᎳᏓᏁ ᎠᏂᏁᎬ ᎯᎠ ᏄᏂᏪᏎᎢ, ᏥᏌ ᏔᏕᏲᎲᏍᎩ, ᏍᎩᏯᏙᎵᎩ.

source: And when he saw them he said, Go, and let the priests see you. And, while they were going, they were made clean.
chr: ᏚᎪᎲᏃ, ᎯᎠ ᏂᏚᏪᏎᎴᎢ, ᎢᏤᎾ ᎠᏥᎸ-ᎠᏁᎶᎯ ᎬᏂᎨᏒ ᏫᏂᏗᏣᏛᏂᏏ. ᎯᎠᏃ ᏄᎵᏍᏔᏁᎢ, ᎠᎾᎢᏒᏉ ᏚᎾᏓᏅᎦᎸᎮᎢ.

source: And one of them, when he saw that he was clean, turning back, gave praise to God in a loud voice;
chr: ᎠᏏᏴᏫᏃ, ᎤᏙᎴᎰᏒ ᎠᏥᏅᏩᏅᎢ, ᏗᎤᏨᏎᎢ, ᎠᎴ ᎠᏍᏓᏯ ᎤᏁᏤ ᎤᎸᏉᏔᏁ ᎤᏁᎳᏅᎯ,

source: And, falling down on his face at the feet of Jesus, he gave the credit to him; and he was a man of Samaria.
chr: ᎠᎴ ᎤᏓᏅᏁ ᎤᎵᏯᏍᏚᏁ ᏚᎳᏍᎬ ᎾᎥᎢ, ᎠᎵᎮᎵᏤᎮᎢ. ᎠᎴ ᏌᎺᎵᏱ ᎡᎯ ᎨᏎᎢ.

source: And Jesus said, Were there not ten men who were made clean? where are the nine?
chr: ᏥᏌᏃ ᎤᏁᏨ ᎯᎠ ᏄᏪᏎᎢ, ᏝᏍᎪ ᎠᏍᎪᎯ ᏱᎨᏥᏅᎦᎸᎡᎢ? ᎠᏎᏃ ᏐᎣᏁᎳ ᎢᏯᏂᏛ ᎭᏢ?

source: Have not any of them come back to give glory to God, but only this one from a strange land?
chr: ᎥᏝ ᏱᎨᏥᏩᏛ ᏅᏓᏳᎾᏨᏛ ᎤᏁᎳᏅᎯ ᎠᏂᎸᏉᏗᏍᎩ, ᎯᎠ ᏅᏩᏓᎴ ᏴᏫ ᎤᏩᏒ.

source: And he said to him, Get up, and go on your way; your faith has made you well.
chr: ᎯᎠᏃ ᏄᏪᏎᎴ ᎾᏍᎩ, ᏔᎴᎲᎦ, ᎠᎴ ᏥᎮᎾ; ᏦᎯᏳᏒ ᏣᏗᏫᏍᏓ.

source: And when the Pharisees put questions to him about when the kingdom of God would come, he gave them an answer and said, The kingdom of God will not come through observation:
chr: ᎠᏂᏆᎵᏏᏃ ᎬᏩᏛᏛᏅ ᎢᏳᏉ ᎤᎷᎯᏍᏗᏱ ᎤᏁᎳᏅᎯ ᎤᎬᏫᏳᎯ ᎨᏒ, ᏚᏁᏤᎴᎢ, ᎯᎠ ᏄᏪᏎᎢ, ᎤᏁᎳᏅᎯ ᎤᎬᏫᏳᎯ ᎨᏒ ᎥᏝ ᎬᎪᏩᏛᏗ ᏱᎨᏎᏍᏗ ᎦᎷᏨᎭ.

source: And men will not say, See, it is here! or, There! for the kingdom of God is among you.
chr: ᎥᏝ ᎠᎴ ᎯᎠ ᏱᏂᎬᏂᏪᏍᎨᏍᏗ, ᎬᏂᏳᏉ ᎠᏂ! ᎠᎴ, ᎬᏂᏳᏉ ᎾᎿᏂ! ᎬᏂᏳᏉᏰᏃ ᎤᏁᎳᏅᎯ ᎤᎬᏫᏳᎯ ᎨᏒ ᎢᏤᎳᏗᏙᎭ.

source: And he said to his disciples, The time will come when you will have a great desire to see one of the days of the Son of man, but you will not see it.
chr: ᎯᎠᏃ ᏂᏚᏪᏎᎴ ᎬᏩᏍᏓᏩᏗᏙᎯ, ᏛᏍᏆᎸᎯ ᎾᎯᏳ ᎨᏒ ᎢᏣᏚᎵᏍᎨᏍᏗ ᎢᏥᎪᏩᏛᏗᏱ ᏌᏉ ᎢᎦ ᏴᏫ ᎤᏪᏥ ᎤᏤᎵᎦ, ᎠᎴ ᎥᏝ ᏴᎨᏥᎪᏩᏛ.

source: And if they say to you, See, it is there! or, It is here! do not go away, or go after them.
chr: ᎠᎴ ᎯᎠ ᏂᎨᏥᏪᏎᎮᏍᏗ, ᎬᏂᏳᏉ ᎠᏂ; ᎠᎴ ᎬᏂᏳᏉ ᎾᎿᏂ; ᏞᏍᏗ ᎢᏤᏅᏒᎩ, ᎠᎴ ᏞᏍᏗ ᏗᏥᏍᏓᏩᏛᏒᎩ.

source: For as in a thunderstorm the bright light is seen from one end of the sky to the other, so will the Son of man be when his time comes.
chr: ᎾᏍᎩᏯᏰᏃ ᎠᎾᎦᎵᏍᎩ ᏌᏉ ᎢᏗᏢ ᎦᎸᎶᎢ ᏨᏗᎦᎵᏍᎪᎢ, ᎤᏣᏘᏂᏃ ᎢᏗᏢ ᎦᎸᎶᎢ ᏥᏫᏗᎦᎸᏌᏓᏗᏍᎪᎢ; ᎾᏍᎩ ᎾᏍᏉ ᏄᏍᏕᏍᏗ ᏴᏫ ᎤᏪᏥ ᎤᏤᎵ ᎢᎦ ᎠᎵᏱᎶᎸᎭ.

source: But first, he will have to undergo much and be put on one side by this generation.
chr: ᎠᏎᏃ ᎢᎬᏱ ᎤᏣᏘ ᏧᏓᎴᏅᏛ ᎤᎩᎵᏲᎢᏍᏗ, ᎠᎴ ᏗᎬᏩᏲᎯᏍᏗ ᎨᏎᏍᏗ ᎪᎯ ᏣᏁᎭ.

source: And as it was in the days of Noah, so will it be in the day of the Son of man.
chr: ᎠᎴ ᎾᏍᎩᏯ ᏥᏄᏍᏕ ᎾᎯᏳ ᏃᏯ ᏤᎮᎢ, ᎾᏍᎩ ᎾᏍᏉ ᏄᏍᏕᏍᏗ ᎾᎯᏳ ᏴᏫ ᎤᏪᏥ ᎤᏤᎵ ᎢᎦ ᎠᎵᏱᎶᎸᎭ.

source: They were feasting and taking wives and getting married, till the day of the overflowing of the waters, when Noah went into the ark, and they all came to destruction.
chr: ᏓᎾᎵᏍᏓᏴᎲᏍᎨᎢ, ᏓᎾᏗᏔᏍᎨᎢ, ᏓᎾᏕᏒᎲᏍᎨᎢ, ᏕᎨᏥᏰᎨᎢ, ᎬᏂ ᎾᎯᏳ ᎢᎦ ᏃᏯ ᎤᏣᏅ ᏥᏳᎯ, ᎠᎴ ᎤᏃᎱᎦᏂᎸ ᎠᎴ ᏂᎦᏛ ᏚᏂᎬᏦᏅ.

source: In the same way, in the days of Lot; they were feasting and trading, they were planting and building;
chr: ᎾᏍᎩᏯ ᎾᏍᏉ ᏥᏄᏍᏕ ᎾᎯᏳ ᎶᏛ ᏤᎮᎢ; ᏓᎾᎵᏍᏓᏴᎲᏍᎨᎢ ᏓᎾᏗᏔᏍᎨᎢ, ᎤᏂᏩᎡᎥᏍᎨᎢ, ᎠᏂᏃᏔᏅᎥᏍᎨᎢ, ᏓᏂᏫᏒᎥᏍᎨᎢ, ᏓᎾᏁᏍᎨᏍᎨᎢ;

source: But on the day when Lot went out of Sodom, fire came down from heaven and destruction came on them all.
chr: ᎠᏎᏃ ᎾᎯᏳᏉ ᎢᎦ ᎶᏛ ᏐᏓᎻ ᎤᏄᎪᏨ, ᎦᎸᎳᏗ ᏧᎦᎿᏁ ᎠᏥᎸ ᎠᎴ ᏌᎪᏂᎨ ᎠᏓᏪᎳᎩᏍᎩ, ᏂᎦᏗᏳᏃ ᏚᏂᎰᏁᎢ.

source: So will it be in the day of the revelation of the Son of man.
chr: ᎾᏍᎩᏯ ᏄᏍᏕᏍᏗ ᎾᎯᏳ ᎢᎦ ᏴᏫ ᎤᏪᏥ ᎦᎾᏄᎪᏂᎸᎭ.

source: On that day, if anyone is on the roof of the house, and his goods are in the house, let him not go down to take them away; and let him who is in the field not go back to his house.
chr: ᎾᎯᏳ ᎢᎦ ᎩᎶ ᎦᏌᎾᎵ ᎤᎩᎴᏍᏗ, ᎤᎿᎥᏃ ᎦᎵᏦᏕ ᎠᎮᏍᏗ, ᏞᏍᏗ ᏅᏓᏳᏠᎠᏒᎩ ᎤᏫᏛᏗᏱ; ᎠᎴ ᎩᎶ ᏠᎨᏏ ᏫᎡᏙᎮᏍᏗ, ᏞᏍᏗ ᎾᏍᏉ ᏅᏓᏳᏨᏒᎩ.

source: Keep in mind Lot's wife.
chr: ᎡᏣᏅᏓᏓ ᎶᏛ ᎤᏓᎵᎢ.

source: If anyone makes an attempt to keep his life, it will be taken from him, but if anyone gives up his life, he will keep it.
chr: ᎩᎶ ᎤᏩᏒ ᎬᏅ ᎤᏍᏕᎸᏗᏱ ᎤᏲᎮᏍᏗ ᎤᏲᎱᏎᏗ ᎨᏎᏍᏗ; ᎩᎶᏃ ᎤᏲᎱᏎᎮᏍᏗ, ᎾᏍᎩ ᎤᏍᏕᎸᏗ ᎨᏎᏍᏗ.

source: I say to you, In that night there will be two men sleeping in one bed, and one will be taken away and the other let go.
chr: ᎢᏤᏲᏎᎭ, ᎾᎯᏳ ᏒᏃᏱ ᎨᏎᏍᏗ ᎠᏂᏔᎵ ᏌᏉ ᎠᏤᏍᏙᎩᎯ ᏓᏂᏅᎨᏍᏗ; ᎠᏏᏴᏫ ᎠᏥᏯᏅᏗ ᎨᏎᏍᏗ, ᏐᎢᏃ ᎠᏥᎧᎯᏯᏍᏗ ᎨᏎᏍᏗ.

source: Two women will be crushing grain together; one will be taken away and the other let go.
chr: ᎠᏂᏔᎵ ᎠᏂᎨᏴ ᎢᏧᎳᎭ ᎠᏂᏍᏙᏍᎨᏍᏗ; ᎠᏏᏴᏫ ᎠᏥᏯᏅᏗ ᎨᏎᏍᏗ, ᏐᎢᏃ ᎠᏥᎧᎯᏯᏍᏗ ᎨᏎᏍᏗ.

source: And they, answering him, said, Where, Lord? And he said to them, Where the body is, there will the eagles come together.
chr: ᎤᏂᏁᏨᏃ ᎯᎠ ᏂᎬᏩᏪᏎᎴᎢ, ᎭᏢ, ᏣᎬᏫᏳᎯ? ᎯᎠᏃ ᏂᏚᏪᏎᎴᎢ, ᎢᎸᎯᏢ ᎪᎱᏍᏗ ᎤᎵᏬᏨᎯ ᏥᎦᏃᎢ, ᎾᎿ ᎠᏬᎭᎵ ᎠᎾᏓᏟᏏᏍᎪᎢ.

source: And he made a story for them, the point of which was that men were to go on making prayer and not get tired;
chr: ᏚᏟᎶᏍᏓᏁᎴᏃ, ᎯᎠ ᏄᏍᏕ ᎤᎬᏩᎴᎢ, ᎾᏍᎩ ᏴᏫ ᏂᎪᎯᎸ ᎤᎾᏓᏙᎵᏍᏙᏗᏱ, ᎠᎴ ᏧᏂᏯᏪᎢᏍᏗ ᏂᎨᏒᎾ;

source: Saying, There was a judge in a certain town, who had no fear of God or respect for man:
chr: ᎯᎠ ᏄᏪᏎᎢ, ᎡᎮ ᏗᎫᎪᏗᏍᎩ ᎢᎸᎯᏢ ᎦᏚᎲᎢ, ᎾᏍᎩ ᎤᏁᎳᏅᎯ ᏂᎦᎾᏰᏍᎬᎾ, ᎠᎴ ᏴᏫ ᏂᏚᏁᎶᏛᎾ;

source: And there was a widow in that town, and she kept on coming to him and saying, Give me my right against the man who has done me wrong.
chr: ᎠᎴ ᎤᏬᏑᎶᏨᎯ ᎾᎿ ᎦᏚᎲ ᎡᎮᎢ; ᎾᏍᎩᏃ ᎤᎷᏤᎴᎢ, ᎯᎠ ᏂᎦᏪᏍᎨᎢ, ᏚᏳᎪᏛ ᏂᏍᎩᎾᏛᏂᏏ ᏦᏍᏓᏓᏱᎵᏙᎯ.

source: And for a time he would not: but later, he said to himself, Though I have no fear of God or respect for man,
chr: ᎠᏎᏃ ᎤᏉᏌᏁ ᎢᎸᏍᎩ ᎢᎪᎯᏛ; ᎣᏂᏍᎩᏂ ᎯᎠ ᏂᎤᏪᏎ ᎤᏩᏒ ᏧᏓᏅᏛᎢ, ᏝᏍᎩᏂᏃᏅ ᏱᏥᎾᏰᏍᎦ ᎤᏁᎳᏅᎯ, ᎠᎴ ᎥᏝ ᏱᏗᏥᏯᏁᎶᏗ ᏴᏫ;

source: Because this widow is a trouble to me, I will give her her right; for if not, I will be completely tired out by her frequent coming.
chr: ᎠᏎᏃ ᎯᎠ ᎤᏬᏑᎶᏨᎯ ᏣᏆᏕᏯᏙᏗᎭ ᏅᏓᎦᎵᏍᏙᏔᏂ ᏚᏳᎪᏛ ᏅᏓᏥᏯᏛᏁᎵ, ᏂᎪᎯᎸᏰᏃ ᎦᎷᎬ ᏱᏓᎩᏯᏪᎢᏍᏓ.

source: And the Lord said, Give ear to the words of the evil judge.
chr: ᎤᎬᏫᏳᎯᏃ ᎯᎠ ᏄᏪᏎᎢ, ᎢᏣᎦᏌᏯᏍᏓ ᏂᏚᏳᎪᏛᎾ ᎢᏯᏛᏁᎯ ᏗᎫᎪᏗᏍᎩ ᏂᎦᏪᏍᎬᎢ.

source: And will not God do right in the cause of his saints, whose cries come day and night to his ears, though he is long in doing it?
chr: ᏝᏍᎪᏃ ᎤᏁᎳᏅᎯ ᏚᏳᎪᏛ ᏱᏂᏙᎬᏛᏂᏏ ᎤᏩᏒ ᏧᏤᎵ ᎨᎦᏑᏴᏛ, ᎾᏍᎩ ᏗᎬᏩᎩᏨᏗ ᏥᎬᏩᏓᏙᎵᏍᏓᏁᎭ, ᎾᏍᏉ ᎪᎯᏗᏳ ᏱᏓᏙᎯᏕᎭ?

source: I say to you that he will quickly do right in their cause. But when the Son of man comes, will there be any faith on earth?
chr: ᎢᏨᏲᏎᎭ ᏞᎩᏳ ᏙᏓᎫᎴᏏ. ᎠᏎᏃ, ᏴᏫ ᎤᏪᏥ ᎦᎷᏨᎭ, ᎪᎯᏳᏗᏍᎪ ᎨᏒ ᏛᏩᏛᎯ ᎡᎶᎯ?

source: And he made this story for some people who were certain that they were good, and had a low opinion of others:
chr: ᎯᎠᏃ ᏚᏟᎶᏍᏓᏁᎴ ᎩᎶ ᎢᏳᎾᏍᏗ ᎤᏅᏒ ᎠᎾᏓᎸᏉᏗᏍᎩ, ᎾᏂᏍᎦᏅᎾ ᎤᎾᏤᎸᎯ, ᎤᏩᎾᏓᎴᏃ ᏅᎵᏌᎵ ᏗᏂᏰᎸᏍᎩ.

source: Two men went up to the Temple for prayer; one a Pharisee, and the other a tax-farmer.
chr: ᎠᏂᏔᎵ ᎠᏂᏍᎦᏯ ᎤᏛᎾ-ᏗᎦᎳᏫᎢᏍᏗᏱ ᎤᎾᏓᏙᎵᏍᏔᏅᏎᎢ, ᎠᏏᏴᏫ ᎠᏆᎵᏏ ᎨᏎᎢ, ᏐᎢᏃ ᎠᏕᎸ-ᎠᎩᏏᏙᎯ.

source: The Pharisee, taking up his position, said to himself these words: God, I give you praise because I am not like other men, who take more than their right, who are evil-doers, who are untrue to their wives, or even like this tax-farmer.
chr: ᎠᏆᎵᏏ ᎤᎴᏁ ᎤᏩᏒ ᎨᏒᎢ ᎤᏓᏙᎵᏍᏔᏁ ᎯᎠ ᏄᏪᏎᎢ; ᏣᏁᎳᏅᎯ ᎬᏯᎵᎡᎵᏤᎭ ᎠᏂᏐᎢ ᏴᏫ ᏄᎾᏍᏛᎢ ᎾᏍᎩ ᎾᏆᏍᏛᎾ ᏥᎩ, ᎾᏍᎩ ᎠᏎᏉ ᎠᎾᏓᎩᎡᎯ ᏥᎩ, ᎠᎴ ᏂᏚᏳᎪᏛᎾ ᎢᏯᎾᏛᏁᎯ, ᎠᎴ ᏗᎾᏓᏲᏁᎯ, ᎠᎴ ᎾᏍᏉ ᎯᎠ ᎠᏕᎸ-ᎠᎩᏏᏙᎯ ᎾᏍᎩ ᏄᏍᏛ ᎾᏆᏍᏛᎾ ᏥᎩ.

source: Twice in the week I go without food; I give a tenth of all I have.
chr: ᏑᎾᏙᏓᏆᏍᏗ ᎨᏒ ᏔᎵ ᎠᎹᏟ ᏂᎬᏍᎪᎢ; ᎠᎴ ᏂᎦᎥ ᎠᎩᎾᎥ ᎠᏍᎪᎯᏁ ᎪᏣᎴᏛ ᏥᎥᏍᎪᎢ.

source: The tax-farmer, on the other hand, keeping far away, and not lifting up even his eyes to heaven, made signs of grief and said, God, have mercy on me, a sinner.
chr: ᎠᏕᎸᏃ-ᎠᎩᏏᏙᎯ ᎢᏅ ᏧᎴᏁᎢ, ᎥᏝ ᏰᎵ ᎦᎸᎳᏗ ᏫᏗᎬᏩᎧᏃᏗ ᏱᎨᏎᎢ, ᎦᏁᏥᏉᏍᎩᏂ ᎤᏩᏂᎴᎢ, ᎯᎠ ᏄᏪᏎᎢ; ᏣᏁᎳᏅᎯ, ᏍᎩᏙᎵᎩ ᏥᏍᎦᎾᎢ.

source: I say to you, This man went back to his house with God's approval, and not the other: for everyone who makes himself high will be made low and whoever makes himself low will be made high.
chr: ᎢᏨᏲᏎᎭ, ᎯᎠ ᎾᏍᎩ ᎠᏍᎦᏯ ᎤᏚᏓᎴᏛ ᏧᏪᏅᏒ ᏭᎶᏎᎢ, ᏐᎢᏃ ᎥᏝ. ᎩᎶᏰᏃ ᎤᏩᏒ ᎢᎠᏓᏌᎳᏗᏍᎨᏍᏗ ᎡᎳᏗ ᎢᏯᎬᏁᏗ ᎨᏎᏍᏗ, ᎩᎶᏃ ᎤᏩᏒ ᎡᎳᏗ ᏂᎠᏓᏛᏁᎮᏍᏗ ᎠᏥᏌᎳᏙᏗ ᎨᏎᏍᏗ.

source: And they took their children to him, so that he might put his hands on them: but when the disciples saw it, they said sharp words to them
chr: ᎠᎴ ᎾᏍᏉ ᏕᎬᏩᏘᏃᎮᎴ ᏧᎾᏍᏗ ᏗᏂᏲᎵ, ᎾᏍᎩ ᏧᏏᏔᏗᏍᏗᏱ; ᎠᏎᏃ ᎬᏩᏍᏓᏩᏗᏙᎯ ᎤᎾᏙᎴᎰᏒ ᏚᏂᎬᏍᎪᎸᏁᎢ.

source: But Jesus sent for them, saying, Let the children come to me, and do not keep them away, for of such is the kingdom of heaven.
chr: ᏥᏌᏃ ᏫᏚᏯᏅᎲ ᎯᎠ ᏄᏪᏎᎢ, ᎤᎾᏁᎳᎩ ᏗᏤᎵᏏ ᏗᏂᏲᎵ ᎬᎩᎷᏤᏗᏱ, ᎠᎴ ᏞᏍᏗ ᏗᏥᏅᏍᏓᏕᎸᎩ; ᎾᏍᎩᏰᏃ ᏄᎾᏍᏗ ᎾᎿ ᎤᏁᎳᏅᎯ ᎤᎬᏫᏳᎯ ᎨᏒᎢ.

source: And a certain ruler put a question to him, saying, Good Master, what have I to do so that I may have eternal life?
chr: ᎩᎶᏃ ᎢᏳᏍᏗ ᏄᎬᏫᏳᏌᏕᎩ ᎤᏛᏛᏁ, ᎯᎠ ᏄᏪᏎᎢ, ᎰᏍᏛ ᏔᏕᏲᎲᏍᎩ, ᎦᏙ ᏯᏆᏛᏁᎸ ᏫᎾᏍᏛᎾ ᎬᏂᏛ ᏱᏥᏩᏛ?

source: And Jesus said to him, Why do you say that I am good? No one is good, but only God.
chr: ᏥᏌᏃ ᎯᎠ ᏄᏪᏎᎴᎢ, ᎦᏙᏃ ᎰᏍᏛ ᎢᏍᏉᏎᎭ? ᎥᏝ ᎩᎶ ᎣᏍᏛ ᏱᎩ ᏌᏉ ᎤᏩᏒᎯᏳ, ᎾᏍᎩ ᎤᏁᎳᏅᎯ.

source: You have knowledge of what the law says: Do not be untrue to your wife, Do not put anyone to death, Do not take what is not yours, Do not give false witness, Give honour to your father and mother.
chr: ᏕᎯᎦᏔᎭᏉ ᏗᎧᎿᏩᏛᏍᏗ, ᏞᏍᏗ ᏣᏓᏲᏁᎸᎩ, ᏞᏍᏗ ᏣᏓᎸᎩ, ᏞᏍᏗ ᏣᏃᏍᎩᏒᎩ, ᏞᏍᏗ ᎦᏰᎪᎩ ᏣᏃᎮᎸᎩ, ᏕᎩᎸᏉᏕᏍᏗ ᏣᏙᏓ ᎠᎴ ᏣᏥ.

source: And he said, All these things I have done from the time when I was a boy.
chr: ᎯᎠᏃ ᏄᏪᏎᎢ, ᎯᎠ ᎾᏍᎩ ᏂᎦᏛ ᏓᎩᎧᎾᏩᏕᏅ ᏥᏧᏣ ᎨᏒ ᏅᏓᎬᏩᏓᎴ ᏅᏛ.

source: And Jesus, hearing it, said to him, One thing you still have need of; get money for your goods, and give it away to the poor, and you will have wealth in heaven; and come after me.
chr: ᏥᏌᏃ ᎾᏍᎩ ᎯᎠ ᎤᏛᎦᏅ, ᎯᎠ ᏄᏪᏎᎴᎢ, ᎠᏏ ᏑᏓᎴᎩ ᏣᎷᎳ; ᎯᎾᏚᎦ ᏂᎦᏛ ᏣᎾᎥᎢ, ᎠᎴ ᏘᏯᏙᎯᏏ ᎤᏲ ᎢᏳᎾᏛᎿᏕᎩ, ᎦᎸᎳᏗᏃ ᏫᏣᎮᏍᏗ ᏧᎬᏩᎶᏗ; ᏖᏒᏃ ᏍᎩᏍᏓᏩᏕᏒᎭ.

source: But at these words he became very sad, for he had great wealth.
chr: ᎾᏍᎩᏃ ᎯᎠ ᎤᏛᎦᏅ ᎤᏣᏘ ᎤᏲ ᎤᏰᎸᏁᎢ; ᎤᏣᏘᏰᏃ ᎤᏪᎿᎢᏳ ᎨᏎᎢ.

source: And Jesus, looking at him, said, How hard it is for those who have wealth to get into the kingdom of God!
chr: ᏥᏌᏃ ᎤᎪᎲ ᎤᏣᏘ ᎤᏲ ᎤᏰᎸᏒᎢ, ᎯᎠ ᏄᏪᏎᎢ, ᏂᎦᎥ ᎠᏍᏓᏱᏳ ᏧᏁᎿᎢ ᎤᏁᎳᏅᎯ ᎤᎬᏫᏳᎯ ᏗᎨᏒ ᏭᏂᏴᏍᏗᏱ!

source: It is simpler for a camel to go through the eye of a needle, than for a man who has much money to come into the kingdom of God.
chr: ᎤᏟᏰᏃ ᎠᎯᏗᏳ ᎨᎻᎵ ᎤᎦᏛᎴᎯᏍᏗᏱ ᏴᎩ ᎦᏌᏁᎾᏛᏗᏱ ᎠᏃ ᎤᏪᎿᎢ ᏴᏫ ᏭᏴᏍᏗᏱ ᎤᏁᎳᏅᎯ ᎤᎬᏫᏳᎯ ᏗᎨᏒᎢ.

source: And those who were present said, Then who may have salvation?
chr: ᎤᎾᏛᎦᏅᎯᏃ ᎯᎠ ᏄᏂᏪᏎᎢ, ᎦᎪᏃ ᏰᎵ ᏯᏥᏍᏕᎸ?

source: But he said, Things which are not possible with man are possible with God.
chr: ᎯᎠᏃ ᏄᏪᏎᎢ, ᎾᏍᎩ ᏴᏫ ᏰᎵ ᎢᎬᏩᎾᏛᏁᏗ ᏂᎨᏒᎾ ᏥᎩ, ᏰᎵᏉ ᎢᎬᏩᏛᏁᏗ ᎤᏁᎳᏅᎯ.

source: And Peter said, See, we have given up what is ours to come after you.
chr: ᎿᏉᏃ ᏈᏓ ᎯᎠ ᏂᎤᏪᏎᎢ, ᎬᏂᏳᏉ ᎠᏴ ᏂᎦᏗᏳ ᏙᎩᏲᏐᏅ, ᎠᎴ ᎢᏨᏍᏓᏩᏕᏅ.

source: And he said to them, Truly I say to you, There is no man who has given up house or wife or brothers or father or mother or children, because of the kingdom of God,
chr: ᎯᎠᏃ ᏂᏚᏪᏎᎴᎢ, ᎤᏙᎯᏳᎯᏯ ᎯᎠ ᏂᏨᏪᏎᎭ, ᎥᏝ ᎩᎶ ᏧᏮᏕᏨᎯ ᏱᎩ ᎦᏁᎸᎢ, ᎠᎴ ᏧᎦᏴᎵᎨᎢ, ᎠᎴ ᎠᎾᎵᏅᏟ, ᎠᎴ ᎤᏓᎵᎢ, ᎠᎴ ᏧᏪᏥ, ᏅᏓᏳᎵᏍᏙᏔᏅᎯ ᎤᏁᎳᏅᎯ ᎤᎬᏫᏳᎯ ᎨᏒᎢ,

source: Who will not get much more in this time, and in the world to come, eternal life.
chr: ᎾᏍᎩ ᎠᏥᏁᏗ ᏂᎨᏒᎾ ᎨᏒ ᎤᏣᏘ ᎢᏳᏩᎫᏗ ᎪᎯ ᎨᏒᎢ, ᏐᎢᏱᏃ ᏗᎨᏒ ᎬᏂᏛ ᏫᎾᏍᏛᎾ.

source: And he took with him the twelve and said to them, Now we are going up to Jerusalem, and all the things which were said by the prophets will be done to the Son of man.
chr: ᎿᏉᏃ ᏔᎳᏚ ᎢᏯᏂᏛ ᎢᏴᏛ ᏫᏚᏘᏅᏍᏔᏁᎢ, ᎠᎴ ᎯᎠ ᏂᏚᏪᏎᎴᎢ, ᎬᏂᏳᏉ ᏥᎷᏏᎵᎻ ᏫᏗᎦᏘ, ᎠᎴ ᏂᎦᎥ ᏚᏃᏪᎸ ᎠᎾᏙᎴᎰᏍᎩ ᏴᏫ ᎤᏪᏥ ᎠᏥᏃᎮᏍᎬ ᎾᏍᎩ ᎢᏳᎵᏍᏙᏗ ᎨᏎᏍᏗ.

source: For he will be given up to the Gentiles, and will be made sport of and put to shame:
chr: ᏧᎾᏓᎴᏅᏛᏰᏃ ᏴᏫ ᏙᏓᎨᏥᏲᎯᏎᎵ, ᎠᎴ ᏓᏰᎦᏕᎰᏔᏂ, ᎠᎴ ᏓᎦᏰᏥᏐᏢᏔᏂ, ᎠᎴ ᏙᏓᏰᎦᎵᏥᏍᏈ,

source: And he will be given cruel blows and put to death, and on the third day he will come back to life.
chr: ᎠᎴ ᏓᎬᏩᎵᎥᏂᎵ, ᎠᎴ ᏓᎬᏩᎵ; ᏦᎢᏁᏃ ᎢᎦ ᏙᏛᎠᎴᎯᏌᏂ.

source: But they did not take in the sense of any of these words, and what he said was not clear to them, and their minds were not able to see it.
chr: ᎠᎴ ᎯᎠ ᎾᏍᎩ ᎥᏝ ᏳᏃᎵᏤᎢ; ᎠᎴ ᎾᏍᎩ ᎯᎠ ᏄᏪᏒ ᎨᎬᏍᎦᎳᏁᎴᎢ, ᎠᎴ ᎥᏝ ᏯᏂᎦᏔᎮ ᎢᏳᏍᏗ ᎦᏛᎬ ᎾᏍᎩ ᎤᏁᏨᎢ.

source: And it came about that when he got near Jericho, a certain blind man was seated by the side of the road, making requests for money from those who went by.
chr: ᎠᎴ ᎯᎠ ᏄᎵᏍᏔᏁᎢ, ᎾᏍᎩ ᏤᎵᎪ ᎾᎥ ᎤᎷᏨ, ᎩᎶ ᎢᏳᏍᏗ ᏗᎨᏫ ᏅᏃᎱᎶᏗ ᎤᏬᎴ ᎠᏚᎳᏗᏍᎨᎢ;

source: And hearing the sound of a great number of people going by, he said, What is this?
chr: ᎤᏛᎦᏅᏃ ᎤᏂᏣᏘ ᎠᏂᎶᏍᎬ ᎤᏛᏛᏁ ᎾᏍᎩ ᎤᏰᎸᏛᎢ.

source: And they said to him, Jesus of Nazareth is going by.
chr: ᎬᏩᏃᏁᎴᏃ ᎾᏍᎩ ᏥᏌ ᎾᏎᎵᏗ ᎡᎯ ᎦᎶᏍᎬᎢ.

source: And he said in a loud voice, Jesus, Son of David, have mercy on me.
chr: ᎤᏪᎷᏁᏃ ᎯᎠ ᏄᏪᏎᎢ, ᏥᏌ, ᏕᏫ ᎤᏪᏥ, ᏍᎩᏙᎵᎩ.

source: And those who were in front made protests and said to him, Be quiet: but he said all the more, O Son of David, have mercy on me.
chr: ᎢᎬᏱᏃ ᎠᏁᎩ ᎬᏩᎬᏍᎪᎸᏁᎢ, ᎡᎳᏪ ᎲᎾ ᎬᏬᏎᎴᎢ; ᎠᏎᏃ ᎤᏟᏉ ᎢᎦᎢ ᎤᏪᎷᏁᎢ; ᏕᏫ ᎤᏪᏥ ᏍᎩᏙᎵᎩ, ᎠᏗᏍᎨᎢ.

source: And Jesus, stopping, gave orders that he was to come to him, and when he came near, he said to him,
chr: ᏥᏌᏃ ᎤᎴᏫᏍᏔᏅ ᎤᏁᏤ ᎠᎦᏘᏃᎮᏗᏱ; ᎿᏉᏃ ᎾᎥ ᎤᎷᏨ ᎤᏛᏛᏁᎢ,

source: What would you have me do for you? And he said, Lord, that I may be able to see again.
chr: ᎯᎠ ᏄᏪᏎᎢ, ᎦᏙ ᏣᏚᎵ ᎬᏯᏛᏁᏗᏱ? ᎯᎠᏃ ᏄᏪᏎᎢ, ᏣᎬᏫᏳᎯ, ᎥᎠᎩᎪᏩᏛᏗᏱ ᎠᏆᏚᎵᎭ.

source: And Jesus said, See again: your faith has made you well.
chr: ᏥᏌᏃ ᎯᎠ ᏄᏪᏎᎴᎢ, ᎨᏣᎪᏩᏛᏗ ᏫᏂᎦᎵᏍᏓ; ᏦᎯᏳᏒ ᏣᏍᏕᎸ.

source: And straight away he was able to see, and he went after him, giving glory to God; and all the people when they saw it gave praise to God.
chr: ᎩᎳᏉᏃ ᎢᏴᏛ ᎬᏩᎪᏩᏛᏗ ᏄᎵᏍᏔᏁᎢ, ᎠᎴ ᎤᏍᏓᏩᏛᏎ ᎦᎸᏉᏗᏍᎨ ᎤᏁᎳᏅᎯ; ᏂᎦᏛᏃ ᏴᏫ ᎤᏂᎪᎲ ᎤᏂᎸᏉᏔᏁ ᎤᏁᎳᏅᎯ.

source: And he went into Jericho, and when he was going through it,
chr: ᏥᏌᏃ ᎤᏴᎴ ᎠᎴ ᎤᎶᏎ ᏤᎵᎪ.

source: A man, named Zacchaeus, who was the chief tax-farmer, and a man of wealth,
chr: ᎠᎴ ᎬᏂᏳᏉ ᎡᎮ ᎠᏍᎦᏯ ᏌᎩᏯ ᏧᏙᎢᏛ, ᎾᏍᎩ ᏄᎬᏫᏳᏒ ᎨᏎ ᎠᏕᎸᎠᎩᏏᏙᎯ, ᎠᎴ ᎤᏪᎿᎢᏳ ᎨᏎᎢ.

source: Made an attempt to get a view of Jesus, and was not able to do so, because of the people, for he was a small man.
chr: ᎠᎴ ᎤᏲᎴ ᏥᏌ ᎤᎪᏩᏛᏗᏱ, ᎾᏍᎩ ᏄᏍᏛᎢ; ᎠᏎᏃ ᎤᏄᎸᏁ ᏅᏗᎦᎵᏍᏙᏗᏍᎨ ᎤᏂᏣᏘ ᎨᏒᎢ, ᎤᏍᏗᎩᏳᏰᏃ ᎨᏎᎢ.

source: And he went quickly in front of them and got up into a tree to see him, for he was going that way.
chr: ᎢᎬᏱᏃ ᏭᏗᏢᏍᏔᏅ ᎤᎸᏎ ᎫᏩᏧᏁᎬ ᏡᎬ ᎤᎪᏩᏛᏗᏱ ᎤᏚᎵᏍᎨᎢ; ᎾᎿᏰᏃ ᎢᏗᏢ ᏭᎶᎯᏍᏗ ᎨᏎᎢ.

source: And when Jesus came to the place, looking up, he said to him, Zacchaeus, be quick and come down, for I am coming to your house today.
chr: ᏥᏌᏃ ᎾᎿ ᎤᎷᏨ, ᎦᎸᎳᏗ ᏫᏚᎧᎿᏁᎢ, ᎠᎴ ᎤᎪᎮᎢ, ᎠᎴ ᎯᎠ ᏄᏪᏎᎴᎢ, ᏌᎩᏯ, ᏞᎩᏳ ᎡᎭᏠᎠᎯ; ᎪᎯᏰᏃ ᎢᎦ ᏥᎩ ᏘᏁᎸ ᏫᎨᏙᎮᏍᏗ.

source: And he came down quickly, and took him into his house with joy.
chr: ᎤᏩᏅᏤᏃ ᏗᎤᏠᎠᏎᎢ, ᎠᎴ ᎤᎵᎮᎵᏨᎯ ᏚᏓᏂᎸᏤᎢ.

source: And when they saw it, they were all angry, saying, He has gone into the house of a sinner.
chr: ᎤᏂᎪᎲᏃ ᎾᏍᎩ ᏂᎦᏛ ᎤᏂᏐᏅᏤᎴᎢ, ᎯᎠ ᏄᏂᏪᏎᎢ, ᏩᏴᏢ ᏮᏛᏒᏎᎵ ᎠᏍᎦᏯ ᎠᏍᎦᎾᎢ.

source: And Zacchaeus, waiting before him, said to the Lord, See, Lord, half of my goods I give to the poor, and if I have taken anything from anyone wrongly, I give him back four times as much.
chr: ᏌᎩᏯᏃ ᎤᎴᏁ ᎯᎠ ᏄᏪᏎᎴ ᎤᎬᏫᏳᎯ, ᎬᏂᏳᏉ, ᏣᎬᏫᏳᎯ, ᎠᏰᎵ ᎢᎦᎢ ᏧᎬᏩᎶᏗ ᎠᎩᎲ ᎤᏲ ᎢᏳᎾᏛᎿᏕᎩ ᏕᏥᎥᏏ; ᎢᏳ ᎠᎴ ᎦᏰᎪᎩ ᎠᏋᏔᏅᎯ ᏱᎩ ᎩᎶ ᎪᎱᏍᏗ ᏱᏥᎩᎡᎸ, ᏅᎩ ᎢᏳᏩᎫᏗ ᎢᎦᎢ ᏥᎥᏏ.

source: And Jesus said to him, Today salvation has come to this house, for even he is a son of Abraham.
chr: ᏥᏌᏃ ᎯᎠ ᏄᏪᏎᎴᎢ, ᎪᎯ ᎢᎦ ᎠᎵᏍᏕᎸᏙᏗ ᎨᏒ ᎦᎷᎩ ᎠᏂ ᎠᏓᏁᎸᎢ, ᏅᏗᎦᎵᏍᏙᏗ ᎾᏍᎩ ᎾᏍᏉ ᎡᏆᎭᎻ ᎤᏪᏥ ᎨᏒᎢ.

source: For the Son of man came to make search for those who are wandering from the way, and to be their Saviour.
chr: ᏴᏫᏰᏃ ᎤᏪᏥ ᏚᏲᎵᎸ ᎠᎴ ᏚᏍᏕᎸᎯᎸ ᎤᎾᎴᎾᎸᎯ ᏥᎨᏒᎩ.

source: And while they were giving ear to these words, he made another story for them, because he was near Jerusalem, and because they were of the opinion that the kingdom of God was coming straight away.
chr: ᎾᏍᎩᏃ ᎯᎠ ᎤᎾᏛᎦᏅ ᎤᏁᏉᎡ ᏚᏟᎶᏍᏓᏁᎴᎢ, ᏅᏗᎦᎵᏍᏙᏗᏍᎨ ᏥᎷᏏᎵᎻ ᎾᎥ ᎤᎷᏥᏗᏒᎢ, ᎠᎴ ᏅᏗᎦᎵᏍᏙᏗᏍᎨ ᎤᏁᎳᏅᎯ ᎤᎬᏫᏳᎯ ᎨᏒ ᎢᎬᏪᏅᏛ ᏓᎦᎾᏄᎪᏥ ᎠᏁᎵᏍᎬᎢ.

source: So he said, A certain man of high birth went into a far-away country to get a kingdom for himself, and to come back.
chr: ᎾᏍᎩ ᎢᏳᏍᏗ ᎯᎠ ᏄᏪᏎᎢ, ᎩᎶ ᎢᏳᏍᏗ ᎠᏍᎦᏰᎬᏍᏓ ᎢᎸᎯᏢ ᎢᏅ ᏭᎶᏎᎢ, ᎤᎸᏒᏎ ᎤᎬᏫᏳᎯ ᎢᏯᎬᏁᏗᏱ ᎠᎴ ᎥᎤᎷᎯᏍᏗᏱ.

source: And he sent for ten of his servants and gave them ten pounds and said to them, Do business with this till I come.
chr: ᏫᏚᏯᏅᎮᏃ ᎠᏍᎪᎯ ᎢᏯᏂᏛ ᏧᏅᏏᏓᏍᏗ, ᎠᎴ ᏕᎤᏲᎯᏎᎴ ᎠᏍᎪᎯ ᎢᏳᏓᎨᏛ [ᎠᏕᎸ,] ᎯᎠ ᏂᏚᏪᏎᎴᎢ, ᎪᎱᏍᏗ ᏕᏨᏗᏍᎨᏍᏗ ᎬᏂ ᎢᏥᎷᏨᎭ.

source: But his people had no love for him, and sent representatives after him, saying, We will not have this man for our ruler.
chr: ᎠᏎᏃ ᏧᏤᎵ ᏴᏫ ᎢᎬᏩᏂᏆᏘᎴᎢ, ᎠᎴ ᏚᏂᏅᏎ ᎬᏩᎨᎮᎩ, ᎯᎠ ᏫᎾᏂᏪᏍᎨᎢ, ᎥᏝ ᏲᎦᏚᎵ ᎯᎠ ᎠᏍᎦᏯ ᎤᎬᏫᏳᎯ ᎣᎦᏤᎵ ᎢᏳᎵᏍᏙᏗᏱ.

source: And when he came back again, having got his kingdom, he gave orders for those servants to whom he had given the money to come to him, so that he might have an account of what business they had done.
chr: ᎯᎠᏃ ᏄᎵᏍᏔᏁᎢ, ᎢᎤᎷᏥᎸ, ᎤᎬᏫᏳᎯ ᎢᏯᎬᏁᎸᎯ ᎨᏎᎢ, ᎤᏁᏤ ᎾᏍᎩ ᎨᏥᏅᏏᏓᏍᏗ ᏫᎨᏥᏯᏅᏗᏱ ᎬᏩᎷᏤᏗᏱ, ᎾᏍᎩ Ꮎ ᎠᏕᎸ ᏧᎨᏅᏛᎯ, ᎾᏍᎩ ᎤᏙᎴᎰᎯᏍᏗᏱ ᎢᎦᎢ ᎠᏂᏏᏴᏫ ᎤᏂᏁᏉᏤᎸ ᎠᏂᏃᏗᏍᎬᎢ.

source: And the first came before him, saying, Lord, your pound has made ten pounds.
chr: ᎢᎬᏱᏃ ᎤᎷᏨᎯ, ᎯᎠ ᏄᏪᏎᎢ, ᏍᎩᎾᏝᎢ, ᏣᏤᎵ ᏑᏓᎨᏛ ᎠᏍᎪᎯ ᎢᏳᏓᎨᏛ ᎤᏁᏉᏨ.

source: And he said to him, You have done well, O good servant: because you have done well in a small thing you will have authority over ten towns.
chr: ᎾᏍᎩᏃ ᎯᎠ ᏄᏪᏎᎴᎢ, ᎣᏏᏳ, ᎰᏍᏛ ᎡᏣᏅᏏᏓᏍᏗ; ᎤᏍᏗ ᎨᏒ ᎣᏏᏳ ᏂᏣᏛᏁᎸ; ᏣᎬᏫᏳᏌᏕᎩ ᎨᏎᏍᏗ ᎠᏍᎪᎯ ᏕᎦᏚᎲᎢ.

source: And another came, saying, Your pound has made five pounds.
chr: ᏔᎵᏁᏃ ᎤᎷᏨᎯ, ᎯᎠ ᏄᏪᏎᎢ, ᏍᎩᎾᏝᎢ, ᏣᏤᎵ ᏑᏓᎨᏛ ᎯᏍᎩ ᎢᏳᏓᎨᏛ ᎤᏁᏉᏨ.

source: And he said, You will be ruler over five towns.
chr: ᎾᏍᎩᏃ ᎾᏍᏉ ᎯᎠ ᏄᏪᏎᎴᎢ, ᏂᎯ ᎾᏍᏉ ᎯᏍᎩ ᎢᎦᏚᎩ ᏣᎬᏫᏳᏌᏕᎩ ᎨᏎᏍᏗ.

source: And another came, saying, Lord, here is your pound, which I put away in a cloth;
chr: ᏅᏩᏓᎴᏃ ᎤᎷᏤᎢ, ᎯᎠ ᏄᏪᏎᎢ, ᏍᎩᎾᏝᎢ, ᎬᏂᏳᏉ ᎠᏂ ᏣᏤᎵ ᏑᏓᎨᏛ, ᎠᎩᏍᏆᏂᎪᏛᎩ ᎠᎩᏣᏄᎸᎩ ᎠᏯᏠᎩᎯ;

source: Because I was in fear of you, for you are a hard man: you take up what you have not put down, and get in grain where you have not put seed.
chr: ᎬᎾᏰᏍᎬᏰᏃ, ᏅᏓᎦᎵᏍᏙᏗᏍᎬᎩ ᎯᏍᏓᏱᏳ ᎨᏒ ᎯᏍᎦᏯ; ᎯᎩᏍᎪᏰᏃ ᎾᏍᎩ ᏂᏣᏅᎾ ᎨᏒᎢ, ᎠᎴ ᎯᏍᎫᏕᏍᎪ ᎾᏍᎩ ᏂᏣᏫᏒᎾ ᎨᏒᎢ.

source: He said to him, By the words of your mouth you will be judged, you bad servant. You had knowledge that I am a hard man, taking up what I have not put down and getting in grain where I have not put seed;
chr: ᎯᎠᏃ ᏄᏪᏎᎴᎢ, ᏨᏒ ᏂᏣᏪᏒ ᏓᎬᏔᏂ ᏙᏓᎬᏳᎪᏓᏁᎵ ᏣᏲ ᎡᏣᏅᏏᏓᏍᏗ. ᎯᎦᏔᎲᎩ ᏥᏍᏓᏱᏳ ᎨᏒᎢ, ᏥᎩᏍᎬ ᎾᏍᎩ ᎠᎩᏅᎯ ᏂᎨᏒᎾ ᎨᏒᎢ, ᎠᎴ ᏥᏍᎫᏕᏍᎬ ᎾᏍᎩ ᎠᎩᏫᏒᎯ ᏂᎨᏒᎾ ᎨᏒᎢ;

source: Why then did you not put my money in a bank, so that when I came I would get it back with interest?
chr: ᎦᏙᏃ Ꮭ ᏗᏍᏆᏂᎪᏙᏗᏱ ᏱᏫᏙᏣᏁ ᏗᏆᏤᎵ ᎠᏕᏄ, ᎠᎩᎷᏥᎸᏃ ᏗᏆᏤᎵ ᎠᎴ ᎤᏂᏁᏉᏨᎯ ᏱᏓᎩᎩᏎᎢ.

source: And he said to the others who were near, Take the pound away from him, and give it to the man who has ten.
chr: ᎯᎠᏃ ᏂᏚᏪᏎᎴ ᎾᎥ ᎠᏂᏙᎾᎢ, ᎡᏥᎩᏏ ᎾᏍᎩ Ꮎ ᏑᏓᎨᏛ, ᎠᎴ ᎠᏍᎪᎯ ᎢᏳᏓᎨᏛ ᏧᎯ ᎡᏥᎥᏏ^

source: And they say to him, Lord, he has ten pounds.
chr: ᎯᎠᏃ ᏂᎬᏩᏪᏎᎴᎢ, ᏗᏍᎩᎾᏝᎢ, ᎠᏍᎪᎯ ᎢᏳᏓᎨᏛ ᏕᎤᎭ^

source: And I say to you that to everyone who has, more will be given, but from him who has not, even what he has will be taken away.
chr: ᎯᎠᏰᏃ ᏂᏨᏪᏎᎭ, ᎾᏍᎩ ᎾᏂᎥ ᎤᏂᎯ ᎨᏥᏁᏗ ᎨᏎᏍᏗ; ᏄᏂᎲᎾᏃ ᏥᎩ, ᎾᏍᎩ ᎾᏍᏉ ᎤᏂᎲ ᎨᏥᎩᎡᏗ ᎨᏎᏍᏗ.

source: And as for those who were against me, who would not have me for their ruler, let them come here, and be put to death before me.
chr: ᎾᏃ ᎬᎩᏍᎦᎩ, ᏄᎾᏚᎵᏍᎬᎾ ᏥᎨᏒ ᎠᎩᎬᏫᏳᎯ ᎢᏯᏆᎵᏍᏙᏗᏱ ᎠᏁᎲᎢ, ᎡᏗᏣᏘᏄᎦ, ᎠᎴ ᏗᏥᎷᎦ ᏥᎦᏔᎲᎢ

source: And when he had said this, he went on in front of them, going up to Jerusalem.
chr: [ᏥᏌᏃ] ᎾᏍᎩ ᏄᏪᏒ, ᎢᎬᏱ ᎤᏪᏅᎭ ᎤᎿᎷᏎ ᏥᎷᏏᎵᎻ ᏩᎦᏖᎢ.

source: And it came about that when he got near Beth-phage and Bethany by the mountain which is named the Mountain of Olives, he sent two of the disciples,
chr: ᎯᎠᏃ ᎸᎵᏍᏔᏁ ᎾᎥ ᎤᎷᏨ ᏒᎦᏙᎯ ᎠᎴ ᏇᏗᏂᏱ, ᎾᎿ ᎣᎵᏩᏲᎯ ᎤᏌᎯᎸ ᏥᏚᏙᎠ, ᎾᏍᎩ ᎠᏂᏔᎵ ᎬᏩᏍᏓᏩᏗᏙᎯ ᏚᏅᏎᎢ,

source: Saying, Go into the little town in front of you, and on going in you will see a young ass fixed with a cord, on which no man has ever been seated; let him loose and take him.
chr: ᎯᎠ ᏄᏪᏎᎢ, ᎢᏍᏕᎾ ᎢᏢ Ꮎ ᏨᏗᎦᏚᎭ, ᎾᎿᏃ ᏫᏍᏗᎷᏨᎭ ᏓᏰᏍᏗᏩᏛᎯ ᎠᎩᎾ ᎨᎵᏌᏕᏍᏗ, ᎾᏍᎩ ᎥᏝ ᎠᏏ ᎩᎶ ᎤᎩᎸᏔᏅᎯ ᏱᎩ; ᎡᏍᏕᎵᏌᏕᏒᎭ ᎠᎴ ᏤᏍᏓᏘᏁᏒᎭ.

source: And if anyone says to you, Why are you taking him? say, The Lord has need of him.
chr: ᎢᏳᏃ ᎩᎶ ᎢᏍᏓᏛᏛᏅ ᎦᏙᏃ ᎢᎡᏍᏕᎵᏌᏕᎭ? ᎢᏍᏙᏎᎸᎭ, ᎯᎠ ᏁᏍᏗᏪᏎᎸᎭ; ᎤᎬᏫᏳᎯᏰᎾ ᎤᏚᎵᎭ.

source: And those whom he sent went away, and it was as he said.
chr: ᎨᏥᏅᏒᎯᏃ ᎤᏁᏅᏎ ᎠᎴ ᏭᏂᏩᏛᎮ ᎾᏍᎩᏯ ᏂᏚᏪᏎᎸᎢ.

source: And when they were getting the young ass, the owners of it said to them, Why are you taking the young ass?
chr: ᎠᏁᎵᏌᏕᏍᎨᏃ ᎠᎩᎾ, ᎤᏂᎾᏝᎢ ᎯᎠ ᏂᎬᏩᏂᏪᏎᎴᎢ, ᎦᏙᏃ ᎢᎡᏍᏕᎵᏌᏕ ᎠᎩᎾ?

source: And they said, The Lord has need of him.
chr: ᎯᎠᏃ ᏄᏂᏪᏎᎢ, ᎤᎬᏫᏳᎯ ᎤᏚᎵᎭ.

source: And they took him to Jesus, and they put their clothing on the ass, and Jesus got on to him.
chr: ᏥᏌᏃ ᎤᎾᏘᏃᎮᎴᎢ; ᏧᎾᏄᏬᏃ ᎠᎩᎾ ᎦᏐᎯ ᏚᏂᏢᏁᎢ, ᎠᎴ ᎾᎿ ᎤᎾᎩᎸᏔᏁ ᏥᏌ.

source: And while he went on his way they put their clothing down on the road in front of him.
chr: ᎠᎢᏒᏃ ᏧᎾᏄᏬ ᏚᏂᏰᏍᏛᏁ ᏅᏃᎯ.

source: And when he came near the foot of the Mountain of Olives, all the disciples with loud voices gave praise to God with joy, because of all the great works which they had seen;
chr: ᎾᎥᏃ ᏭᎷᏨ, ᎾᎿ ᎠᎦᏐᎠᏍᎬ ᎢᏴᏛ ᎣᎵᏩᏲ ᎤᏌᎯᎸᎢ, ᏂᎦᏛ ᎤᏂᏣᏘ ᎨᏒ ᎠᎾᏓᏍᏓᏩᏗᏙᎯ ᎤᎾᎴᏅᎮ ᎠᎾᎵᎮᎵᎨ ᎠᎴ ᎠᏂᎸᏉᏗᏍᎨ ᎤᏁᎳᏅᎯ ᎠᏍᏓᏯ ᎠᏂᏁᎨᎢ, ᏅᏗᎦᎵᏍᏙᏗᏍᎨ ᏂᎦᏛ ᎤᏍᏆᏂᎪᏗ ᏕᎦᎸᏫᏍᏓᏁᎸ ᎤᏂᎪᎲᎢ;

source: Saying, A blessing on the King who comes in the name of the Lord; peace in heaven and glory in the highest.
chr: ᎯᎠ ᎾᏂᏪᏍᎨᎢ. ᎦᎸᏉᏗᏳ ᎨᏎᏍᏗ ᎾᏍᎩ Ꮎ ᎤᎬᏫᏳᎯ ᏱᎰᏩ ᏚᏙᏍᏛ ᏥᎦᎷᎯᏍᏗᎭ; ᎦᎸᎳᏗ ᏅᏩᏙᎯᏯᏛ ᎨᏎᏍᏗ, ᎠᎴ ᎦᎸᏉᏗᏳ ᎨᏎᏍᏗ ᏩᏍᏛ ᎦᎸᎳᏗᏳ ᎨᏒᎢ!

source: And some of the Pharisees among the people said to him, Master, make your disciples be quiet.
chr: ᎢᎦᏛᏃ ᎠᏂᏆᎵᏏ ᎾᎿ ᎤᏂᏣᏘ ᏄᎾᏛᏅ ᎯᎠ ᏅᏗᎬᏩᏪᏎᎴᎢ, ᏔᏕᏲᎲᏍᎩ, ᏘᏅᏍᏓᏗᏏ ᎨᏣᏍᏓᏩᏗᏙᎯ.

source: And he said in answer, I say to you, if these men keep quiet, the very stones will be crying out.
chr: ᎤᏁᏨᏃ ᎯᎠ ᏂᏚᏪᏎᎴᎢ, ᎯᎠ ᏂᏨᏪᏎᎭ, ᎢᏳᏃ ᎯᎠ ᎡᎳᏪᏱ ᏳᏅᏅ, ᏅᏯ ᎩᎳᏉ ᎢᏴᏛ ᏯᏁᎷᎲᎦ.

source: And when he got near and saw the town, he was overcome with weeping for it,
chr: ᎾᎥᏃ ᎤᎷᏨ, ᏚᎧᎿᏅ ᎦᏚᎲᎢ, ᎤᏍᎪᏂᎴᎢ,

source: Saying, If you, even you, had knowledge today, of the things which give peace! but you are not able to see them.
chr: ᎯᎠ ᏄᏪᏎᎢ, ᎢᏳᏃ ᏂᎯ ᏱᎯᎦᏔᎮᎢ, ᎥᎥ, ᏂᎯ, ᎪᎯ ᎾᏍᏉ ᎾᏍᎩ ᎯᎠ ᏣᏤᎵ ᎢᎦ ᎨᏒᎢ, ᎾᏍᎩ ᏅᏩᏙᎯᏯᏛ ᏣᏁᎯ ᎨᏒᎢ! ᎠᏎᏃ ᎿᏉ ᎡᏨᏍᎦᎳᏁᎸ.

source: For the time will come when your attackers will put a wall round you, and come all round you and keep you in on every side,
chr: ᎾᎯᏳᏰᏃ ᎨᏒ ᏓᏣᎵᏰᎢᎶᎮᎵ, ᎾᏍᎩ ᎨᏣᏍᎦᎩ ᎨᏒ ᏙᏛᏁᎵᏍᎦᎸᎯ ᎬᏩᏚᏫᏛ, ᎠᎴ ᏙᏓᎨᏣᏚᏫᏍᏔᏂ, ᎠᎴ ᏅᎦᏘᏓᏂ ᎨᏣᎵᏍᏚᏕᏍᏗ.

source: And will make you level with the earth, and your children with you; and there will not be one stone resting on another in you, because you did not see that it was your day of mercy.
chr: ᎠᎴ ᎦᏙᎯ ᏓᎨᏣᏡᏂ, ᎠᎴ ᏗᏤᏥ ᎬᏂᏯᎢ ᎨᏎᏍᏗ; ᎠᎴ ᎥᏝ ᎨᏣᎯᏰᏗ ᏱᎨᏎᏍᏗ ᏌᏉ ᏅᏯ ᏱᏚᏓᏌᏝᎮᏍᏗ; ᏅᏗᎦᎵᏍᏙᏗᎭ ᏂᎦᏔᎲᎾ ᏥᎨᏒ ᎢᏳ ᎡᏣᏩᏛᎯᎯᏍᏗ ᎨᏒᎢ.

source: And he went into the Temple and put out those who were trading there,
chr: ᏭᏴᎸᏃ ᎤᏛᎾ-ᏗᎦᎳᏫᎢᏍᏗᏱ, ᎤᎴᏅᎮ ᏚᏄᎪᏫᏎ ᎾᎿ ᎠᏂᏃᏗᏍᎩ, ᎠᎴ ᎤᏂᏩᏒᎥᏍᎩ;

source: Saying to them, It has been said, My house is to be a house of prayer, but you have made it a hole of thieves.
chr: ᎯᎠ ᏂᏚᏪᏎᎴᎢ, ᎯᎠ ᏂᎬᏅ ᎪᏪᎳ, ᏥᏁᎸ ᎠᏓᏙᎵᏍᏙᏗᏱ ᎠᏓᏁᎸ ᏚᏙᎠ, ᎠᏎᏃ ᏂᎯ ᎠᏂᏃᏍᎩᏍᎩ ᎤᏂᏴᏍᏗᏱ ᎤᏍᏓᎦᎸ ᏂᏨᏁᎸ.

source: And every day he was teaching in the Temple. But the chief priests and the scribes and the rulers of the people were attempting to put him to death;
chr: ᏂᏚᎩᏨᏂᏒᏃ ᏓᏕᏲᎲᏍᎨ ᎤᏛᎾᏗᎦᎳᏫᎢᏍᏗᏱ. ᎠᏎᏃ ᏄᏂᎬᏫᏳᏒ ᎠᏥᎸ-ᎠᏁᎶᎯ ᎠᎴ ᏗᏃᏪᎵᏍᎩ ᎠᎴ ᏄᏂᎬᏫᏳᏒ ᎠᏫ ᎤᎾᏁᎶᏔᏁ ᎬᏩᎯᏍᏗᏱ.

source: But they were not able to do anything, because the people all kept near him, being greatly interested in his words.
chr: ᎠᎴ ᎤᎾᏠᏤ ᎢᏳᎾᏛᏁᏗᏱ; ᏂᎦᏛᏰᏃ ᏴᏫ ᎬᏩᏝᏫᏍᏗᏕᎨ ᎬᏩᏛᏓᏍᏓᏁᏗᏱ.

source: And it came about on one of those days, when he was teaching the people in the Temple and preaching the good news,
chr: ᎯᎠᏃ ᏄᎵᏍᏔᏁᎢ, ᎾᏍᎩ ᏌᏉ ᎢᎦ ᎾᎯᏳ ᎨᏒ, ᏕᎨᏲᎲᏍᎨ ᏴᏫ ᎤᏛᎾᏗᎦᎳᏫᎢᏍᏗᏱ, ᎣᏍᏛ ᎧᏃᎮᏛ ᎠᎵᏥᏙᎲᏍᎨᎢ, ᎾᏍᎩ ᏄᏂᎬᏫᏳᏒ ᎠᏥᎸᎠᏁᎶᎯ, ᎠᎴ ᏗᏃᏪᎵᏍᎩ ᎬᏩᏃᎴᎢ, ᎤᎾᎵᎪᏎ ᏗᏂᎳᏫᎩ,

source: That the chief priests and the scribes and the rulers of the people came to him and said, Make clear to us by what authority you do these things and who gave you this authority.
chr: ᎠᎴ ᎬᏩᎵᏃᎮᏔᏁ, ᎯᎠ ᏄᏂᏪᏎᎢ, ᏍᎩᏃᎲᏏ, ᎦᏙ ᏣᎵᏍᎦᏍᏙᏗ ᎯᎠ ᎾᏍᎩ ᏥᏄᏍᏗ ᏥᏕᏣᎸᏫᏍᏓᏁᎭ? ᎠᎴ ᎦᎪ ᎾᏍᎩ Ꮎ ᏣᏁᎸᎯ ᎾᏍᎩ ᎢᏣᏛᏁᏗᏱ?

source: And in answer he said to them, I will put a question to you, and do you give me an answer:
chr: ᎤᏁᏨᏃ ᎯᎠ ᏂᏚᏪᏎᎴᎢ, ᎠᏴ ᎾᏍᏉ ᏑᏓᎴᎩ ᏓᏨᏯᏛᏛᏂ; ᎠᎴ ᏍᎩᏃᎲᏏ;

source: The baptism of John, was it from heaven or of men?
chr: ᏣᏂ ᏧᏓᏬᏍᏗ ᎨᏒᎢ, ᎦᎸᎳᏗᏍᎪ ᏧᏓᎴᏁᎢ, ᏴᏫᏉᎨ ᎠᏁᎲᎢ.

source: And they said among themselves, If we say, From heaven; he will say, Why did you not have faith in him?
chr: ᏙᏧᎾᏓᏅᏛᏃ ᎤᎾᏓᏅᏖᎴ ᎯᎠ ᎾᏂᏪᏍᎨᎢ, ᎢᏳᏃ ᎦᎸᎳᏗ, ᏲᎦᏛᏅ, ᎯᎠ ᏱᏃᎩᏪᏏ, ᎦᏙᏃ Ꮭ ᏱᎡᏦᎢᏳᏁᎢ?

source: But if we say, Of men; we will be stoned by the people, for they are certain that John was a prophet.
chr: ᎢᏳᏃ ᏴᏫᏉ ᎠᏁᎲᎢ, ᏲᎦᏛᏅ, ᏂᎦᏛᏉ ᏴᏫ ᏅᏯ ᏱᏕᎪᎬᏂᏍᏓ; ᏣᏂᏰᏃ ᎠᏙᎴᎰᏍᎩ ᎨᏒᎩ, ᎠᏁᎵᎭ.

source: And they made answer that they had no idea where it came from.
chr: ᎤᏂᏁᏨᏃ, ᎥᏝ ᏲᏥᎦᏔᎭ ᏧᏓᎴᏅᎢ, ᎤᎾᏛᏁᎢ.
